import plotly.graph_objects as go

names = ["Власова Каріна", 
        "Власова Марина", 
        "Войдюк Ігор", 
        "Волощук Ростислав",
        "Давиденко Вікторія",
        "Давиденко Катерина",
        "Деморацький Назар",
        "Денисенко Владислав",
        "Євлахович Ігор",
        "Зінін Максим",
        "Ібе Джанет",
        "Карчевський Володимир",
        "Литвин Анастасія",
        "Лужанський Ростислав",
        "Мітькін Дмитро",
        "Мозговий Максим",
        "Моргун Ігор",
        "Мошняга Антон",
        "Орлов Андрій",
        "Паладій Даниїл",
        "Покотило Марія",
        "Прокопенко Роман",
        "Руденко Євгеній",
        "Сайфулліна Софія"]

absence = [4, 6, 2, 5, 4, 5, 8, 5, 4, 7, 0, 8, 2, 1, 5, 11, 7, 6, 3, 5, 5, 2, 7, 3]

fig = go.Figure(data = [go.Bar(x = names, y = absence, marker={'color': 'light blue'})])

'''bar = go.Bar(x=names, y=absence)
bar.marker.color = ['red' if i >= 10 else 'grey' for i in absence]
fig = go.Figure(bar)'''

fig.update_layout(title="Python Hometask", xaxis_title="Кн-22", yaxis_title="Кількість пропущених занять")

fig.show()
